# Group By

In [22]:
import numpy as np

In [1]:
import pandas as pd

In [2]:
maasData = {'Departman':['Yazılım', 'Yazılım', 'Pazarlama', 'Pazarlama', 'Hukuk', 'Hukuk'],
            'Calisan Ismi':['Ali', 'Veli', 'Ayşe', 'Fatma', 'Hasan', 'Hüseyin'],
           'Maas':[300, 200, 150, 400, 500, 350]}

In [3]:
maasDataFrame = pd.DataFrame(data=maasData)

In [4]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım          Ali   300
1    Yazılım         Veli   200
2  Pazarlama         Ayşe   150
3  Pazarlama        Fatma   400
4      Hukuk        Hasan   500
5      Hukuk      Hüseyin   350

## Group By ile verilerimizi gruplamaya baslayalim;

Veri Tipini ve RAM'daki yerini getirdi
Group By yeni bir Data Frame dondurur. Bu yuzden bir degiskene esitlememiz gerekir.

In [5]:
maasGroupBy = maasDataFrame.groupby('Departman')

In [6]:
maasGroupBy

#### Hangi Departmanda Kac Kisi Calisiyor COUNT ile onu getirdik;

In [46]:
maasGroupBy.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

### Departmanda calisan kisilerin ort. maaslarini MEAN ile getirdik;

In [48]:
maasGroupBy.mean()

            Maas
Departman
Hukuk      425.0
Pazarlama  275.0
Yazılım    250.0

#### Min();

In [49]:
maasGroupBy.min()

          Calisan Ismi  Maas
Departman
Hukuk            Hasan   350
Pazarlama         Ayşe   150
Yazılım            Ali   200

#### Max();

In [50]:
maasGroupBy.max()

          Calisan Ismi  Maas
Departman
Hukuk          Hüseyin   500
Pazarlama        Fatma   400
Yazılım           Veli   300

## Describe() fonksiyonu; cogu ise yarar ozelliklerini getirir;

In [52]:
maasGroupBy.describe() # std = standart sapma

           Maas
          count   mean         std    min    25%    50%    75%    max
Departman
Hukuk       2.0  425.0  106.066017  350.0  387.5  425.0  462.5  500.0
Pazarlama   2.0  275.0  176.776695  150.0  212.5  275.0  337.5  400.0
Yazılım     2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0